; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-8-48)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	package46 - package
	package47 - package
	package48 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-5 - location
	p0-6 - location
	p1-0 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p3-0 - location
	p4-1 - location
	p4-6 - location
	p5-3 - location
	p6-2 - location
	p6-5 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s2)
	(at driver3 s5)
	(at driver4 s0)
	(at driver5 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at truck8 s3)
	(empty truck8)
	(at package1 s5)
	(at package2 s6)
	(at package3 s2)
	(at package4 s2)
	(at package5 s2)
	(at package6 s5)
	(at package7 s2)
	(at package8 s5)
	(at package9 s2)
	(at package10 s6)
	(at package11 s6)
	(at package12 s2)
	(at package13 s1)
	(at package14 s1)
	(at package15 s2)
	(at package16 s0)
	(at package17 s6)
	(at package18 s5)
	(at package19 s2)
	(at package20 s1)
	(at package21 s6)
	(at package22 s3)
	(at package23 s2)
	(at package24 s6)
	(at package25 s4)
	(at package26 s6)
	(at package27 s0)
	(at package28 s1)
	(at package29 s2)
	(at package30 s0)
	(at package31 s5)
	(at package32 s1)
	(at package33 s2)
	(at package34 s4)
	(at package35 s2)
	(at package36 s4)
	(at package37 s3)
	(at package38 s2)
	(at package39 s4)
	(at package40 s6)
	(at package41 s1)
	(at package42 s1)
	(at package43 s3)
	(at package44 s0)
	(at package45 s3)
	(at package46 s5)
	(at package47 s1)
	(at package48 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s2 s6)
	(link s6 s2)
	(link s4 s0)
	(link s0 s4)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s4)
	(link s4 s5)
	(link s5 s6)
	(link s6 s5)
)
	(:goal (and
	(at driver5 s3)
	(at truck1 s6)
	(at truck3 s4)
	(at truck4 s0)
	(at truck5 s0)
	(at truck6 s5)
	(at truck7 s1)
	(at truck8 s6)
	(at package1 s6)
	(at package2 s1)
	(at package3 s4)
	(at package4 s1)
	(at package5 s3)
	(at package6 s6)
	(at package7 s0)
	(at package8 s0)
	(at package9 s3)
	(at package10 s6)
	(at package11 s5)
	(at package12 s5)
	(at package13 s0)
	(at package14 s2)
	(at package15 s5)
	(at package16 s3)
	(at package17 s6)
	(at package18 s4)
	(at package19 s6)
	(at package20 s6)
	(at package21 s5)
	(at package22 s1)
	(at package23 s3)
	(at package24 s4)
	(at package25 s6)
	(at package26 s0)
	(at package27 s6)
	(at package28 s4)
	(at package29 s0)
	(at package30 s1)
	(at package31 s0)
	(at package32 s4)
	(at package33 s6)
	(at package34 s5)
	(at package35 s3)
	(at package36 s3)
	(at package37 s3)
	(at package39 s0)
	(at package40 s1)
	(at package41 s6)
	(at package43 s3)
	(at package44 s0)
	(at package45 s2)
	(at package46 s0)
	(at package47 s4)
	(at package48 s6)
	))


)

; plan
1. (board-truck driver4 s0 truck5)
   deleted: (at driver4 s0) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 6 of 54
2. (board-truck driver5 s2 truck7)
   deleted: (at driver5 s2) (empty truck7)
   added: (driving driver5 truck7)
   goals met: 6 of 54
3. (board-truck driver2 s2 truck1)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 54
4. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 6 of 54
5. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 6 of 54
6. (drive-truck driver2 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 6 of 54
7. (drive-truck driver4 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 5 of 54
8. (load-truck s1 package47 truck1)
   deleted: (at package47 s1)
   added: (in package47 truck1)
   goals met: 5 of 54
9. (load-truck s1 package41 truck1)
   deleted: (at package41 s1)
   added: (in package41 truck1)
   goals met: 5 of 54
10. (drive-truck driver2 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 5 of 54
11. (load-truck s4 package48 truck1)
   deleted: (at package48 s4)
   added: (in package48 truck1)
   goals met: 5 of 54
12. (unload-truck s4 package47 truck1)
   deleted: (in package47 truck1)
   added: (at package47 s4)
   goals met: 6 of 54
13. (load-truck s4 package39 truck1)
   deleted: (at package39 s4)
   added: (in package39 truck1)
   goals met: 6 of 54
14. (drive-truck driver2 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 6 of 54
15. (unload-truck s0 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s0)
   goals met: 7 of 54
16. (load-truck s0 package30 truck1)
   deleted: (at package30 s0)
   added: (in package30 truck1)
   goals met: 7 of 54
17. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 7 of 54
18. (load-truck s1 package32 truck1)
   deleted: (at package32 s1)
   added: (in package32 truck1)
   goals met: 7 of 54
19. (drive-truck driver2 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 7 of 54
20. (load-truck s4 package36 truck1)
   deleted: (at package36 s4)
   added: (in package36 truck1)
   goals met: 7 of 54
21. (load-truck s4 package34 truck1)
   deleted: (at package34 s4)
   added: (in package34 truck1)
   goals met: 7 of 54
22. (drive-truck driver2 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 7 of 54
23. (load-truck s0 package27 truck1)
   deleted: (at package27 s0)
   added: (in package27 truck1)
   goals met: 7 of 54
24. (load-truck s0 package16 truck1)
   deleted: (at package16 s0)
   added: (in package16 truck1)
   goals met: 7 of 54
25. (drive-truck driver2 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 7 of 54
26. (unload-truck s4 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s4)
   goals met: 8 of 54
27. (load-truck s4 package25 truck1)
   deleted: (at package25 s4)
   added: (in package25 truck1)
   goals met: 8 of 54
28. (drive-truck driver2 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 8 of 54
29. (load-truck s6 package40 truck5)
   deleted: (at package40 s6)
   added: (in package40 truck5)
   goals met: 8 of 54
30. (load-truck s6 package26 truck5)
   deleted: (at package26 s6)
   added: (in package26 truck5)
   goals met: 8 of 54
31. (load-truck s6 package24 truck5)
   deleted: (at package24 s6)
   added: (in package24 truck5)
   goals met: 8 of 54
32. (load-truck s6 package21 truck5)
   deleted: (at package21 s6)
   added: (in package21 truck5)
   goals met: 8 of 54
33. (drive-truck driver4 s6 s0 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   goals met: 9 of 54
34. (drive-truck driver2 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 9 of 54
35. (drive-truck driver4 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 8 of 54
36. (load-truck s5 package8 truck1)
   deleted: (at package8 s5)
   added: (in package8 truck1)
   goals met: 8 of 54
37. (drive-truck driver2 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 9 of 54
38. (unload-truck s6 package48 truck1)
   deleted: (in package48 truck1)
   added: (at package48 s6)
   goals met: 10 of 54
39. (unload-truck s6 package41 truck1)
   deleted: (in package41 truck1)
   added: (at package41 s6)
   goals met: 11 of 54
40. (drive-truck driver2 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 10 of 54
41. (load-truck s5 package6 truck1)
   deleted: (at package6 s5)
   added: (in package6 truck1)
   goals met: 10 of 54
42. (drive-truck driver2 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 11 of 54
43. (unload-truck s6 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s6)
   goals met: 12 of 54
44. (unload-truck s6 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s6)
   goals met: 13 of 54
45. (drive-truck driver2 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 12 of 54
46. (unload-truck s0 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 13 of 54
47. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 13 of 54
48. (load-truck s3 package45 truck1)
   deleted: (at package45 s3)
   added: (in package45 truck1)
   goals met: 13 of 54
49. (unload-truck s3 package36 truck1)
   deleted: (in package36 truck1)
   added: (at package36 s3)
   goals met: 14 of 54
50. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 14 of 54
51. (drive-truck driver2 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 14 of 54
52. (load-truck s5 package46 truck1)
   deleted: (at package46 s5)
   added: (in package46 truck1)
   goals met: 14 of 54
53. (unload-truck s5 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s5)
   goals met: 15 of 54
54. (drive-truck driver2 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 15 of 54
55. (unload-truck s0 package46 truck1)
   deleted: (in package46 truck1)
   added: (at package46 s0)
   goals met: 16 of 54
56. (drive-truck driver2 s0 s6 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   goals met: 17 of 54
57. (unload-truck s6 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s6)
   goals met: 18 of 54
58. (load-truck s6 package2 truck1)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   goals met: 18 of 54
59. (drive-truck driver2 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 17 of 54
60. (drive-truck driver2 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 17 of 54
61. (unload-truck s1 package40 truck5)
   deleted: (in package40 truck5)
   added: (at package40 s1)
   goals met: 18 of 54
62. (load-truck s1 package28 truck5)
   deleted: (at package28 s1)
   added: (in package28 truck5)
   goals met: 18 of 54
63. (load-truck s1 package20 truck5)
   deleted: (at package20 s1)
   added: (in package20 truck5)
   goals met: 18 of 54
64. (drive-truck driver4 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 19 of 54
65. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 19 of 54
66. (drive-truck driver4 s0 s5 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s5)
   goals met: 18 of 54
67. (unload-truck s1 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s1)
   goals met: 19 of 54
68. (unload-truck s1 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 20 of 54
69. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 20 of 54
70. (load-truck s5 package31 truck5)
   deleted: (at package31 s5)
   added: (in package31 truck5)
   goals met: 20 of 54
71. (unload-truck s5 package21 truck5)
   deleted: (in package21 truck5)
   added: (at package21 s5)
   goals met: 21 of 54
72. (drive-truck driver4 s5 s0 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   goals met: 22 of 54
73. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 22 of 54
74. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 22 of 54
75. (load-truck s3 package22 truck1)
   deleted: (at package22 s3)
   added: (in package22 truck1)
   goals met: 22 of 54
76. (unload-truck s3 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s3)
   goals met: 23 of 54
77. (unload-truck s0 package31 truck5)
   deleted: (in package31 truck5)
   added: (at package31 s0)
   goals met: 24 of 54
78. (unload-truck s0 package26 truck5)
   deleted: (in package26 truck5)
   added: (at package26 s0)
   goals met: 25 of 54
79. (load-truck s2 package9 truck7)
   deleted: (at package9 s2)
   added: (in package9 truck7)
   goals met: 25 of 54
80. (load-truck s2 package7 truck7)
   deleted: (at package7 s2)
   added: (in package7 truck7)
   goals met: 25 of 54
81. (load-truck s2 package5 truck7)
   deleted: (at package5 s2)
   added: (in package5 truck7)
   goals met: 25 of 54
82. (load-truck s2 package4 truck7)
   deleted: (at package4 s2)
   added: (in package4 truck7)
   goals met: 25 of 54
83. (load-truck s2 package35 truck7)
   deleted: (at package35 s2)
   added: (in package35 truck7)
   goals met: 25 of 54
84. (load-truck s2 package33 truck7)
   deleted: (at package33 s2)
   added: (in package33 truck7)
   goals met: 25 of 54
85. (load-truck s2 package3 truck7)
   deleted: (at package3 s2)
   added: (in package3 truck7)
   goals met: 25 of 54
86. (load-truck s2 package29 truck7)
   deleted: (at package29 s2)
   added: (in package29 truck7)
   goals met: 25 of 54
87. (load-truck s2 package23 truck7)
   deleted: (at package23 s2)
   added: (in package23 truck7)
   goals met: 25 of 54
88. (drive-truck driver5 s2 s0 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s0)
   goals met: 25 of 54
89. (drive-truck driver2 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 25 of 54
90. (drive-truck driver4 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 24 of 54
91. (unload-truck s2 package45 truck1)
   deleted: (in package45 truck1)
   added: (at package45 s2)
   goals met: 25 of 54
92. (load-truck s2 package19 truck1)
   deleted: (at package19 s2)
   added: (in package19 truck1)
   goals met: 25 of 54
93. (drive-truck driver2 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 26 of 54
94. (unload-truck s6 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s6)
   goals met: 27 of 54
95. (load-truck s6 package11 truck1)
   deleted: (at package11 s6)
   added: (in package11 truck1)
   goals met: 27 of 54
96. (drive-truck driver2 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 26 of 54
97. (load-truck s5 package18 truck1)
   deleted: (at package18 s5)
   added: (in package18 truck1)
   goals met: 26 of 54
98. (unload-truck s5 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s5)
   goals met: 27 of 54
99. (drive-truck driver2 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 27 of 54
100. (load-truck s2 package15 truck1)
   deleted: (at package15 s2)
   added: (in package15 truck1)
   goals met: 27 of 54
101. (drive-truck driver2 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 27 of 54
102. (unload-truck s4 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s4)
   goals met: 28 of 54
103. (drive-truck driver2 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 28 of 54
104. (unload-truck s5 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s5)
   goals met: 29 of 54
105. (load-truck s5 package1 truck1)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 29 of 54
106. (drive-truck driver2 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 29 of 54
107. (drive-truck driver2 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 30 of 54
108. (unload-truck s6 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s6)
   goals met: 31 of 54
109. (load-truck s1 package14 truck5)
   deleted: (at package14 s1)
   added: (in package14 truck5)
   goals met: 31 of 54
110. (drive-truck driver4 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 32 of 54
111. (drive-truck driver4 s0 s2 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   goals met: 31 of 54
112. (unload-truck s2 package14 truck5)
   deleted: (in package14 truck5)
   added: (at package14 s2)
   goals met: 32 of 54
113. (drive-truck driver4 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 32 of 54
114. (unload-truck s4 package28 truck5)
   deleted: (in package28 truck5)
   added: (at package28 s4)
   goals met: 33 of 54
115. (unload-truck s4 package24 truck5)
   deleted: (in package24 truck5)
   added: (at package24 s4)
   goals met: 34 of 54
116. (drive-truck driver4 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 35 of 54
117. (drive-truck driver5 s0 s3 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s3)
   goals met: 35 of 54
118. (unload-truck s3 package9 truck7)
   deleted: (in package9 truck7)
   added: (at package9 s3)
   goals met: 36 of 54
119. (unload-truck s3 package5 truck7)
   deleted: (in package5 truck7)
   added: (at package5 s3)
   goals met: 37 of 54
120. (unload-truck s3 package35 truck7)
   deleted: (in package35 truck7)
   added: (at package35 s3)
   goals met: 38 of 54
121. (drive-truck driver5 s3 s0 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s0)
   goals met: 38 of 54
122. (unload-truck s0 package7 truck7)
   deleted: (in package7 truck7)
   added: (at package7 s0)
   goals met: 39 of 54
123. (unload-truck s0 package29 truck7)
   deleted: (in package29 truck7)
   added: (at package29 s0)
   goals met: 40 of 54
124. (drive-truck driver5 s0 s1 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s1)
   goals met: 41 of 54
125. (walk driver3 s5 p5-3)
   deleted: (at driver3 s5)
   added: (at driver3 p5-3)
   goals met: 41 of 54
126. (walk driver3 p5-3 s3)
   deleted: (at driver3 p5-3)
   added: (at driver3 s3)
   goals met: 41 of 54
127. (unload-truck s1 package4 truck7)
   deleted: (in package4 truck7)
   added: (at package4 s1)
   goals met: 42 of 54
128. (drive-truck driver5 s1 s4 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s4)
   goals met: 41 of 54
129. (unload-truck s4 package3 truck7)
   deleted: (in package3 truck7)
   added: (at package3 s4)
   goals met: 42 of 54
130. (drive-truck driver2 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 41 of 54
131. (drive-truck driver2 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 41 of 54
132. (unload-truck s1 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s1)
   goals met: 42 of 54
133. (load-truck s1 package13 truck1)
   deleted: (at package13 s1)
   added: (in package13 truck1)
   goals met: 42 of 54
134. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 42 of 54
135. (unload-truck s0 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s0)
   goals met: 43 of 54
136. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 43 of 54
137. (load-truck s2 package12 truck1)
   deleted: (at package12 s2)
   added: (in package12 truck1)
   goals met: 43 of 54
138. (drive-truck driver2 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 43 of 54
139. (unload-truck s5 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s5)
   goals met: 44 of 54
140. (drive-truck driver2 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 45 of 54
141. (drive-truck driver5 s4 s3 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s3)
   goals met: 45 of 54
142. (unload-truck s3 package23 truck7)
   deleted: (in package23 truck7)
   added: (at package23 s3)
   goals met: 46 of 54
143. (drive-truck driver5 s3 s4 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   goals met: 46 of 54
144. (board-truck driver3 s3 truck8)
   deleted: (at driver3 s3) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 46 of 54
145. (drive-truck driver3 s3 s4 truck8)
   deleted: (at truck8 s3)
   added: (at truck8 s4)
   goals met: 46 of 54
146. (walk driver1 s5 p5-3)
   deleted: (at driver1 s5)
   added: (at driver1 p5-3)
   goals met: 46 of 54
147. (walk driver1 p5-3 s3)
   deleted: (at driver1 p5-3)
   added: (at driver1 s3)
   goals met: 46 of 54
148. (board-truck driver1 s3 truck4)
   deleted: (at driver1 s3) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 46 of 54
149. (drive-truck driver1 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 47 of 54
150. (drive-truck driver3 s4 s6 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s6)
   goals met: 48 of 54
151. (disembark-truck driver1 s0 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 48 of 54
152. (board-truck driver1 s0 truck6)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 48 of 54
153. (drive-truck driver1 s0 s5 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s5)
   goals met: 49 of 54
154. (drive-truck driver5 s4 s6 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s6)
   goals met: 49 of 54
155. (unload-truck s6 package33 truck7)
   deleted: (in package33 truck7)
   added: (at package33 s6)
   goals met: 50 of 54
156. (drive-truck driver5 s6 s4 truck7)
   deleted: (at truck7 s6)
   added: (at truck7 s4)
   goals met: 50 of 54
157. (drive-truck driver5 s4 s1 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s1)
   goals met: 51 of 54
158. (drive-truck driver4 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 50 of 54
159. (unload-truck s6 package20 truck5)
   deleted: (in package20 truck5)
   added: (at package20 s6)
   goals met: 51 of 54
160. (drive-truck driver5 s1 s4 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s4)
   goals met: 50 of 54
161. (drive-truck driver5 s4 s3 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s3)
   goals met: 50 of 54
162. (disembark-truck driver5 s3 truck7)
   deleted: (driving driver5 truck7)
   added: (at driver5 s3) (empty truck7)
   goals met: 51 of 54
163. (drive-truck driver1 s5 s4 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   goals met: 50 of 54
164. (drive-truck driver4 s6 s0 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   goals met: 51 of 54
165. (drive-truck driver1 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 51 of 54
166. (board-truck driver5 s3 truck7)
   deleted: (at driver5 s3) (empty truck7)
   added: (driving driver5 truck7)
   goals met: 50 of 54
167. (disembark-truck driver1 s1 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s1) (empty truck6)
   goals met: 50 of 54
168. (board-truck driver1 s1 truck3)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 50 of 54
169. (drive-truck driver1 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 51 of 54
170. (drive-truck driver5 s3 s4 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   goals met: 51 of 54
171. (drive-truck driver5 s4 s1 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s1)
   goals met: 52 of 54
172. (disembark-truck driver5 s1 truck7)
   deleted: (driving driver5 truck7)
   added: (at driver5 s1) (empty truck7)
   goals met: 52 of 54
173. (board-truck driver5 s1 truck6)
   deleted: (at driver5 s1) (empty truck6)
   added: (driving driver5 truck6)
   goals met: 52 of 54
174. (drive-truck driver5 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 52 of 54
175. (drive-truck driver5 s4 s5 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   goals met: 53 of 54
176. (disembark-truck driver5 s5 truck6)
   deleted: (driving driver5 truck6)
   added: (at driver5 s5) (empty truck6)
   goals met: 53 of 54
177. (walk driver5 s5 p5-3)
   deleted: (at driver5 s5)
   added: (at driver5 p5-3)
   goals met: 53 of 54
178. (walk driver5 p5-3 s3)
   deleted: (at driver5 p5-3)
   added: (at driver5 s3)
   goals met: 54 of 54
